# StairsMultistoryUpToLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsMultistoryUpToLevel Property
ParameterTypeId Class See Also
---
"Multistory Top Level": The top level of multi-story stairs
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsMultistoryUpToLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsMultistoryUpToLevel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsMultistoryUpToLevel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace